_posts/2013-10-23-Writing-exams-in-org-mode.html
---
title: Writing exams in org-mode
date: 2013/10/23 15:54:20
updated: 2013/10/23 18:26:57
categories: org-mode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The exam section</a>
<ul>
<li><a href="#sec-1-1">1.1. Do you get it?</a></li>
<li><a href="#sec-1-2">1.2. Multipart question</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Circle the best answer</a></li>
<li><a href="#sec-1-2-2">1.2.2. Describe a cat.</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Essay question</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Back to the grade table construction</a></li>
<li><a href="#sec-3">3. building the pdf</a></li>
</ul>
</div>
</div>
<p>
There are a few aspects of writing exams that are tedious the way I normally do it. Typically I write exams in Word because I can easily see the layout, how much whitespace there is to write answers in, etc&#x2026; I like to put a gradesheet on the final page which lists each problem, the points it is worth, and a blank to put the grade for that problem into.  It is tedious to go back through 10 pages of questions to look up all the points, enter them in, add them up, etc&#x2026; And if I decide to renumber the questions or move them, it must be repeated.
</p>

<p>
Construction of the grade sheet ought to be automated. That is not going to happen in my hands in MS Word. I have seen this done in LaTeX in the Acrotex educational package, but I don't see myself hacking LaTeX any  time soon either. Enter org-mode. I could see writing the exam in org-mode, and writing some code to construct the grade table. 
</p>


<p>
The idea is that we would store the points in a PROPERTY of an org-heading. Then, to create the table, we just loop through the headlines, gather the levels and points, and then construct a table to put in the exported LaTeX. The next section contains some exam questions that will form the basis of this post.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The exam section</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Do you get it?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
What is the answer to the universe?
 \vspace{2cm} 
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Multipart question</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Circle the best answer</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
What is 1 + 1?
a) 2
b) 3
c) 4
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Describe a cat.</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
\vspace{2cm} 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Essay question</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Expound on the meaning of life.
 \vspace{3cm} 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Back to the grade table construction</h2>
<div class="outline-text-2" id="text-2">
<p>
We will parse the buffer to get the headlines, and then extract some properties from each headline. For each headline that has points we will print the title and points it is worth,  and finally the total number of points.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq total-points 0)    <span style="color: #ff0000; font-weight: bold;">; </span><span style="color: #ff0000; font-weight: bold;">counter for the total points</span>

<span style="color: #ff0000; font-weight: bold;">;; </span><span style="color: #ff0000; font-weight: bold;">now loop over headlines</span>
(org-element-map 
    (org-element-parse-buffer 'headline) 'headline 
  <span style="color: #ff0000; font-weight: bold;">;; </span><span style="color: #ff0000; font-weight: bold;">function to print headline title and points</span>
  (<span style="color: #8b0000;">lambda</span> (headline) 
    (<span style="color: #8b0000;">let</span> ((points (org-element-property <span style="color: #cd0000;">:POINTS</span> headline))
          (title  (org-element-property <span style="color: #cd0000;">:title</span> headline)))
      (<span style="color: #8b0000;">if</span> points (<span style="color: #8b0000;">progn</span>
                   (setq total-points (+ total-points (string-to-number points)))
                   (princ (format <span style="color: #228b22;">"title=%s\nPOINTS=%s\n\n"</span> title points)))))))

(princ (format <span style="color: #228b22;">"Total points = %s"</span> total-points))
</pre>
</div>

<pre class="example">
title=Do you get it?
POINTS=5

title=Circle the best answer
POINTS=10

title=Describe a cat.
POINTS=4

title=Essay question
POINTS=25

Total points = 44
</pre>

<p>
That is the foundation for the grade table. What I would like is the grade table to be structured like this:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">problem</td>
<td class="left">Points</td>
<td class="left">grade</td>
</tr>

<tr>
<td class="left">ref to heading</td>
<td class="left">#points</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Where the <code>ref to heading</code> is the same number as the actual heading. During the export, labels are generated for each section, which we could refer to. To take advantage of this we need to figure out what the labels are, so we can refer to them. 
</p>

<p>
After quite a bit of hackery, I figured out how to access this information <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. It is not readily apparent this is how to do it, but it works!
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let*</span> ((info (org-export-collect-tree-properties (org-element-parse-buffer 'headline) '()))
       (headline-numbering (plist-get info <span style="color: #cd0000;">:headline-numbering</span>)))
(org-element-map (plist-get info <span style="color: #cd0000;">:parse-tree</span>) 'headline
  (<span style="color: #8b0000;">lambda</span> (headline) 
    (format <span style="color: #228b22;">"\\ref{sec-%s}"</span> (mapconcat 
                      (<span style="color: #8b0000;">lambda</span> (x) (format <span style="color: #228b22;">"%s"</span> x)) (cdr (assoc headline headline-numbering)) <span style="color: #228b22;">"-"</span>)))))
</pre>
</div>

<pre class="example">
("\\ref{sec-1}" "\\ref{sec-2}" "\\ref{sec-2-1}" "\\ref{sec-2-2}" "\\ref{sec-2-2-1}" "\\ref{sec-2-2-2}" "\\ref{sec-2-3}" "\\ref{sec-3}" "\\ref{sec-}")
</pre>


<p>
So, let us try putting this all together <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq total-points 0)    <span style="color: #ff0000; font-weight: bold;">; </span><span style="color: #ff0000; font-weight: bold;">counter for the total points</span>
(princ <span style="color: #228b22;">"#+caption: The grade table\n"</span>)
(princ <span style="color: #228b22;">"#+attr_latex: :align |c|c|c|\n"</span>)
(princ <span style="color: #228b22;">"|-\n"</span>)
(princ <span style="color: #228b22;">"|Problem|Possible Points|Points earned|\n|-\n"</span>)
(<span style="color: #8b0000;">let*</span> ((info (org-export-collect-tree-properties (org-element-parse-buffer 'headline) '()))
       (headline-numbering (plist-get info <span style="color: #cd0000;">:headline-numbering</span>)))
  (org-element-map (plist-get info <span style="color: #cd0000;">:parse-tree</span>) 'headline
    (<span style="color: #8b0000;">lambda</span> (headline) 
      (<span style="color: #8b0000;">let</span> ((ref (format <span style="color: #228b22;">"\\ref{sec-%s}"</span> (mapconcat 
                                          (<span style="color: #8b0000;">lambda</span> (x) (format <span style="color: #228b22;">"%s"</span> x)) (cdr (assoc headline headline-numbering)) <span style="color: #228b22;">"-"</span>)))
            (points (org-element-property <span style="color: #cd0000;">:POINTS</span> headline)))
        (<span style="color: #8b0000;">if</span> points (<span style="color: #8b0000;">progn</span>
                     (setq total-points (+ total-points (string-to-number points)))
                     (princ (format <span style="color: #228b22;">"|%s|%s|  |\n|-\n"</span> ref points))))))))

(princ (format <span style="color: #228b22;">"| |Total points| %s|\n"</span> total-points))
(princ <span style="color: #228b22;">"|-\n"</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption align="above"><span class="table-number">Table 1:</span> The grade table</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Problem</th>
<th scope="col" class="right">Possible Points</th>
<th scope="col" class="left">Points earned</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">\ref{sec-1-1-1}</td>
<td class="right">5</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\ref{sec-1-1-2-1}</td>
<td class="right">10</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\ref{sec-1-1-2-2}</td>
<td class="right">4</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\ref{sec-1-1-3}</td>
<td class="right">25</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">Total points</td>
<td class="left">44</td>
</tr>
</tbody>
</table>

<p>
Note this table gets munged by Mathjax in HTML. I am not sure that is fixable. You can open the <a href="/media/2013-10-23-Writing-exams-in-org-mode/writing-exams-in-orgmode.pdf">pdf</a> and see the results.
</p>

<p>
This works ok. There is still some work to be done. For example the boxes in the grade table are not very large. The references are a little odd in this case, but that is an artifact of the fact that you cannot nest a section deeper than 3 levels in LaTeX without some work, and I nested my exam section in a second level heading so it would appear in the blog post. A real application of this would not have all these other sections, and would not export the build section. It is a tad tedious to hand build the table, but not too bad. 
</p>

<p>
It might be better to use CUSTOM_ID labels in the sections, rather than try to build up the references. You still need to think about what the labels would be, and we are used to seeing numbers!
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> building the pdf</h2>
<div class="outline-text-2" id="text-3">
<p>
I have gotten in the habit of building the latex file from commands, and manually running them with C-c C-c.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let</span> ((org-latex-default-packages-alist
       '((<span style="color: #228b22;">""</span> <span style="color: #228b22;">"minted"</span> nil)
         (<span style="color: #228b22;">"linktocpage,</span>
<span style="color: #228b22;">  pdfstartview=FitH,</span>
<span style="color: #228b22;">  colorlinks,</span>
<span style="color: #228b22;">  linkcolor=blue,</span>
<span style="color: #228b22;">  anchorcolor=blue,</span>
<span style="color: #228b22;">  citecolor=blue,</span>
<span style="color: #228b22;">  filecolor=blue,</span>
<span style="color: #228b22;">  menucolor=blue,</span>
<span style="color: #228b22;">  urlcolor=blue"</span> <span style="color: #228b22;">"hyperref"</span> t)))
      (async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil))

  (org-latex-export-to-latex async subtreep visible-only body-only '()))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">progn</span>
  (shell-command <span style="color: #228b22;">"pdflatex -shell-escape writing-exams-in-orgmode"</span>)
  (shell-command <span style="color: #228b22;">"pdflatex -shell-escape writing-exams-in-orgmode"</span>))
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>
This code does not generate correct labels for headlines with TODO in them, or for footnotes.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>
Note this table gets munged by Mathjax in HTML.
</p></div>


</div>
</div><p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/10/23/Writing-exams-in-org-mode.org">org-mode source</a><p>